projects/06_ahmed_body_aerodynamics/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    ( -5.0  -5.0   0.0 )   // 0
    ( 12.0  -5.0   0.0 )   // 1
    ( 12.0   5.0   0.0 )   // 2
    ( -5.0   5.0   0.0 )   // 3
    ( -5.0  -5.0   5.0 )   // 4
    ( 12.0  -5.0   5.0 )   // 5
    ( 12.0   5.0   5.0 )   // 6
    ( -5.0   5.0   5.0 )   // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (85 50 25) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    ground
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }

    top
    {
        type symmetryPlane;
        faces
        (
            (4 5 6 7)
        );
    }

    side_left
    {
        type symmetryPlane;
        faces
        (
            (0 1 5 4)
        );
    }

    side_right
    {
        type symmetryPlane;
        faces
        (
            (3 7 6 2)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
